In [1]:
import pandas as pd

In [2]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

In [5]:
result = student_data.groupby('school_code')

In [8]:
result.get_group('s001')

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1

In [9]:
print(type(result))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

2. Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

In [11]:
result.agg({'age':['min','max','mean']}).reset_index()

  school_code age
              min max  mean
0        s001  12  13  12.5
1        s002  12  14  13.0
2        s003  13  13  13.0
3        s004  12  12  12.0

3. Write a Pandas program to split the following given dataframe into groups based on school code and class

In [14]:
result = student_data.groupby(['school_code','class'])

4. Write a Pandas program to split the following given dataframe into groups based on school code and cast grouping as a list.

In [17]:
print(list(result))

[(('s001', 'V'),    school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address
S1  street1  ), (('s001', 'VI'),    school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address
S4  street1  ), (('s002', 'V'),    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2  ), (('s003', 'VI'),    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3), (('s004', 'VI'),    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4  )]

6. Write a Pandas program to split the following given dataframe into groups based on school code and call a specific group with the name of the group.

In [18]:
result = student_data.groupby('school_code')

In [19]:
result.get_group('s001')

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1

In [20]:
diamonds = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/diamonds.csv')

In [25]:
diamonds.groupby(['cut','color'], as_index = False).agg({'depth':'mean'})

          cut color      depth
0        Fair     D  64.048466
1        Fair     E  63.319643
2        Fair     F  63.508013
3        Fair     G  64.339809
4        Fair     H  64.585149
5        Fair     I  64.220571
6        Fair     J  64.357143
7        Good     D  62.365710
8        Good     E  62.203751
9        Good     F  62.202310
10       Good     G  62.526636
11       Good     H  62.499573
12       Good     I  62.475096
13       Good     J  62.395765
14      Ideal     D  61.678370
15      Ideal     E  61.686677
16      Ideal     F  61.675562
17      Ideal     G  61.700164
18      Ideal     H  61.733194
19      Ideal     I  61.793598
20      Ideal     J  61.821987
21    Premium     D  61.169245
22    Premium     E  61.175909
23    Premium     F  61.259974
24    Premium     G  61.279480
25    Premium     H  61.322034
26    Premium     I  61.328641
27    Premium     J  61.390099
28  Very Good     D  61.750165
29  Very Good     E  61.730250
30  Very Good     F  61.721627
31  Very Good     G  61.841279
32  Very Good     H  61.968366
33  Very Good     I  61.934551
34  Very Good     J  61.902065